DingDa-H/stm32-CAN/User/APP/task.c
#include "stm32f1xx_hal.h"
#include <can.h>
#include "string.h"
#include <stdint.h>
#include <oled_device.h>
#include "button_mid.h"
#include "task.h"
#include <stdio.h>


extern CAN_HandleTypeDef hcan;

// 全局接收缓存

static CAN_RxHeaderTypeDef s_rxHeader;
static uint8_t s_aucRxBuf[8];
static uint32_t s_ulRxId;
static uint8_t  s_ucRxLength;

// 全局发送缓存
static uint8_t s_Txdata[8] = {0x55,0x66,0x48,0x77};

// 全局发送结构体（使用指定初始化器，与 can.h 中字段顺序一致）
stCanTxParamTdf stTxMsgArray[] =
{
	{.ulID    = 0x12345600,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
	{.ulID    = 0x12345601,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
	{.ulID    = 0x12345603,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
	{.ulID    = 0x123456FF,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},

	{.ulID    = 0x0789AB00,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
	{.ulID    = 0x0789AB01,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
	{.ulID    = 0x0789AB03,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
	{.ulID    = 0x0789AB0F,.ucDLC   = 4,.pucData = s_Txdata,.ulIDE   = CAN_ID_EXT,.ulRTR   = CAN_RTR_DATA,},
};
static uint8_t i = 0;						//用来表示stTxMsgArray的第i项
// service/task.c 应用层
void vCanService_Init(void)
{
	CAN_FilterTypeDef filter;
	// 202607010,配置为32位列表模式
	filter.FilterBank 				=0;						//滤波器编号0-13
	filter.FilterActivation 		=ENABLE;				//是否启用该滤波器
	filter.FilterFIFOAssignment 	=CAN_FILTER_FIFO0;		// CAN_FILTER_FIFO0 或 CAN_FILTER_FIFO1
	uint32_t ID = 0x12345600u<<3|(0x4);
	filter.FilterIdHigh 			=ID>>16;				/* 32位滤波器的高 16 位（对应标准 ID 的 11 位或扩展 ID 的高 16 位） */
	filter.FilterIdLow 				=ID;				/* 32位滤波器的低 16 位（对应扩展 ID 的低 18 位、IDE、RTR 位等） */
	uint32_t MASK = (0x1FFFFF00u<<3)|(0x4)|(0x2);
	filter.FilterMaskIdHigh 		=MASK>>16;				/* 与 FilterIdHigh 对应的掩码高 16 位（1 表示必须匹配，0 表示不关心） */
	filter.FilterMaskIdLow 			=MASK; 			/* 与 FilterIdLow 对应的掩码低 16 位（1 表示必须匹配，0 表示不关心） */
	filter.FilterScale 				=CAN_FILTERSCALE_32BIT;	/* 滤波器位宽：16 位或 32 位 */
	filter.FilterMode 				=CAN_FILTERMODE_IDMASK;	/* 滤波器模式：列表模式（ID 完全匹配）或掩码模式（用掩码筛选） */
	filter.SlaveStartFilterBank 	=0;
	HAL_CAN_ConfigFilter(&hcan, &filter);
	HAL_CAN_Start(&hcan);
//	HAL_CAN_ActivateNotification(&hcan, CAN_IT_RX_FIFO0_MSG_PENDING);	//激活中断的

}
 
/**
 * @brief 		OLED初始化函数
 * @version 	
 * @data 			
 * @note 		
 */
void vOledInit(void)
{
	stOledStaticParamTdf stInit;
	stInit.pstSclGpioBase	= GPIOB;
	stInit.pstSdaGpioBase	= GPIOB;
	stInit.usSclGpioPin		= GPIO_PIN_8;
	stInit.usSdaGpioPin		= GPIO_PIN_9;
	
	vOledDeviceInit(&stInit, OLED);
	vOledClearBuffer(OLED);			//清屏
}

/**
 * @brief 		物理按键初始化
 * @param 	
 * @data 		
 * @note 		
 */
void Button_Init(void)
{
	stBtnStaticParamTdf stBtnInit;
	stBtnInit.emButLevel					= emBtnActiveLevel_Low;
	stBtnInit.pstGpioBase					= GPIOB;
	stBtnInit.ulDebounceMs 					= 20;
	stBtnInit.ulLongPressMs					= 100000;			//不允许长按和双击
	stBtnInit.ulDoubleClickMs				= 10;
	stBtnInit.usGpioPin						= GPIO_PIN_1;
	
	vBtnParamInit(&stBtnInit,BUTTON_DOWN);
	
	stBtnInit.emButLevel					= emBtnActiveLevel_Low;
	stBtnInit.pstGpioBase					= GPIOB;
	stBtnInit.ulDebounceMs 					= 20;
	stBtnInit.ulLongPressMs					= 100000;
	stBtnInit.ulDoubleClickMs				= 10;
	stBtnInit.usGpioPin						= GPIO_PIN_11;
	
	vBtnParamInit(&stBtnInit,BUTTON_UP);
	
	stBtnInit.emButLevel					= emBtnActiveLevel_High;
	stBtnInit.pstGpioBase					= GPIOB;
	stBtnInit.ulDebounceMs 					= 20;
	stBtnInit.ulLongPressMs					= 100000;
	stBtnInit.ulDoubleClickMs				= 10;
	stBtnInit.usGpioPin						= GPIO_PIN_12;
	
	vBtnParamInit(&stBtnInit,BUTTON_ENABLE);
	
	stBtnInit.emButLevel					= emBtnActiveLevel_High;
	stBtnInit.pstGpioBase					= GPIOB;
	stBtnInit.ulDebounceMs 					= 20;
	stBtnInit.ulLongPressMs					= 100000;
	stBtnInit.ulDoubleClickMs				= 200;
	stBtnInit.usGpioPin						= GPIO_PIN_13;
	
	vBtnParamInit(&stBtnInit,BUTTON_CANCEL);
}

/**
 * @brief 		接收处理函数
 * @param 	
 * @retval 		
 * @note 		需要轮询
 */
uint8_t ucMyCanExecute(void)
{
    if (ucMyCan_ReceiveFlag()) {
        vMyCan_Receive(&s_rxHeader, s_aucRxBuf);
        return 1;   // 有新数据
    }
    return 0;       // 无数据
}


void vtask(void)
{
	vBtnExecute(); 
	
	// 复用之前的代码，规定BUTTON_UP是发送。
	emButEventTdf emEventUp  		 = emBtnGetCurEvent(BUTTON_UP);
    emButEventTdf emEventDown		 = emBtnGetCurEvent(BUTTON_DOWN);
	emButEventTdf emEventEnable 	 = emBtnGetCurEvent(BUTTON_ENABLE);
	emButEventTdf emEventCancel   	 = emBtnGetCurEvent(BUTTON_CANCEL);
	if (emEventUp == emBtnEvent_Click) {
		if(i >= sizeof(stTxMsgArray) / sizeof(stTxMsgArray[0]))
			i = 0;
		vMyCan_Transmit(&stTxMsgArray[i++]);
		s_Txdata[0]++;
		s_Txdata[1]++;
		s_Txdata[2]++;
		s_Txdata[3]++;
		
		vBtnEventClear(BUTTON_UP);					// 仅在触发事件后清除，避免提前清除
		
	}
	if (emEventDown == emBtnEvent_Click) {
		
		vBtnEventClear(BUTTON_DOWN);
	}		

	
	vOledWriteStringToBuffer(6,0,(uint8_t*)"Rx:",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
	vOledWriteStringToBuffer(6,12,(uint8_t*)"RXID:",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
	vOledWriteStringToBuffer(6,36,(uint8_t*)"DATA:",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
	vOledWriteStringToBuffer(6,24,(uint8_t*)"Len:",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);

	uint8_t ucNewRx = ucMyCanExecute();				// 接收处理函数
	static uint8_t s_aucStrBuf[16];
	if(ucNewRx)
	{
		vOledClearBuffer(OLED);
		if(s_rxHeader.IDE == CAN_ID_STD)
		{
			s_ulRxId = s_rxHeader.StdId;
			vOledWriteStringToBuffer(24,0,(uint8_t*)"Std",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
		}
		else
		{
			s_ulRxId = s_rxHeader.ExtId;
			vOledWriteStringToBuffer(24,0,(uint8_t*)"Exd",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
		}
		if(s_rxHeader.RTR == CAN_RTR_DATA)
		{
			s_ucRxLength = s_rxHeader.DLC;
			vOledWriteStringToBuffer(48,0,(uint8_t*)"Data",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
			
			/* 显示 Length */
			snprintf((char *)s_aucStrBuf, sizeof(s_aucStrBuf), "%d", s_ucRxLength);
			vOledWriteStringToBuffer(36, 24, s_aucStrBuf, emOledFontSize_6x12, emOledPixelShowMode_Positive, OLED);
			vOledWriteHexToBuffer(36, 36, s_aucRxBuf, s_ucRxLength, emOledFontSize_6x12, emOledPixelShowMode_Positive, OLED);
			
		}
		else
		{
			vOledWriteStringToBuffer(6,24,(uint8_t*)"Len: 0",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
			vOledWriteStringToBuffer(48,0,(uint8_t*)"Remote",emOledFontSize_6x12,emOledPixelShowMode_Positive,OLED);
		}
		/* 显示 RxID */
		snprintf((char *)s_aucStrBuf, sizeof(s_aucStrBuf), "0x%03lX", (unsigned long)s_ulRxId);
		vOledWriteStringToBuffer(36, 12, s_aucStrBuf, emOledFontSize_6x12, emOledPixelShowMode_Positive, OLED);

	}
	vOledRefreshFromBuffer(OLED);
}
